turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U2C.atdf
        <register caption="System Clock Glitch Input Filter Select Register" name="PIO_SCIFSR" offset="0x0080" rw="W" size="4">
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000001" name="P0"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000002" name="P1"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000004" name="P2"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000008" name="P3"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000010" name="P4"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000020" name="P5"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000040" name="P6"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000080" name="P7"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000100" name="P8"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000200" name="P9"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000400" name="P10"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00000800" name="P11"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00001000" name="P12"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00002000" name="P13"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00004000" name="P14"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00008000" name="P15"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00010000" name="P16"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00020000" name="P17"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00040000" name="P18"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00080000" name="P19"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00100000" name="P20"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00200000" name="P21"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00400000" name="P22"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x00800000" name="P23"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x01000000" name="P24"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x02000000" name="P25"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x04000000" name="P26"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x08000000" name="P27"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x10000000" name="P28"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x20000000" name="P29"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x40000000" name="P30"/>
          <bitfield caption="System Clock Glitch Filtering Select." mask="0x80000000" name="P31"/>
        </register>
        <register caption="Debouncing Input Filter Select Register" name="PIO_DIFSR" offset="0x0084" rw="W" size="4">
          <bitfield caption="Debouncing Filtering Select." mask="0x00000001" name="P0"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000002" name="P1"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000004" name="P2"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000008" name="P3"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000010" name="P4"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000020" name="P5"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000040" name="P6"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000080" name="P7"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000100" name="P8"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000200" name="P9"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000400" name="P10"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00000800" name="P11"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00001000" name="P12"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00002000" name="P13"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00004000" name="P14"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00008000" name="P15"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00010000" name="P16"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00020000" name="P17"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00040000" name="P18"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00080000" name="P19"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00100000" name="P20"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00200000" name="P21"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00400000" name="P22"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x00800000" name="P23"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x01000000" name="P24"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x02000000" name="P25"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x04000000" name="P26"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x08000000" name="P27"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x10000000" name="P28"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x20000000" name="P29"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x40000000" name="P30"/>
          <bitfield caption="Debouncing Filtering Select." mask="0x80000000" name="P31"/>
        </register>
