turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U2C.atdf
        <register caption="SMC Pulse Register (CS_number = 3)" name="SMC_PULSE3" offset="0xB0" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 3)" name="SMC_CYCLE3" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 3)" name="SMC_TIMINGS3" offset="0xB8" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 3)" name="SMC_MODE3" offset="0xBC" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE3__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE3__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE3__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE3__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC OCMS Register" name="SMC_OCMS" offset="0x110" rw="RW" size="4">
          <bitfield caption="Static Memory Controller Scrambling Enable" mask="0x00000001" name="SMSE"/>
          <bitfield caption="SRAM Scrambling Enable" mask="0x00000002" name="SRSE"/>
        </register>
        <register caption="SMC OCMS KEY1 Register" name="SMC_KEY1" offset="0x114" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="SMC OCMS KEY2 Register" name="SMC_KEY2" offset="0x118" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="Write Protection Control Register" name="SMC_WPCR" offset="0x1E4" rw="W" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WP_EN"/>
          <bitfield caption="Write Protection KEY password" mask="0xFFFFFF00" name="WP_KEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SMC_WPSR" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x0000000F" name="WP_VS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WP_VSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SMC_CFG__PAGESIZE">
        <value caption="Main area 512 Bytes + Spare area 16 Bytes = 528 Bytes" name="PS512_16" value="0x0"/>
        <value caption="Main area 1024 Bytes + Spare area 32 Bytes = 1056 Bytes" name="PS1024_32" value="0x1"/>
        <value caption="Main area 2048 Bytes + Spare area 64 Bytes = 2112 Bytes" name="PS2048_64" value="0x2"/>
        <value caption="Main area 4096 Bytes + Spare area 128 Bytes = 4224 Bytes" name="PS4096_128" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_CFG__DTOMUL">
        <value caption="DTOCYC" name="X1" value="0x0"/>
        <value caption="DTOCYC x 16" name="X16" value="0x1"/>
        <value caption="DTOCYC x 128" name="X128" value="0x2"/>
        <value caption="DTOCYC x 256" name="X256" value="0x3"/>
        <value caption="DTOCYC x 1024" name="X1024" value="0x4"/>
        <value caption="DTOCYC x 4096" name="X4096" value="0x5"/>
        <value caption="DTOCYC x 65536" name="X65536" value="0x6"/>
        <value caption="DTOCYC x 1048576" name="X1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="SMC_ECC_MD__ECC_PAGESIZE">
        <value caption="Main area 512 Bytes + Spare area 16 Bytes = 528 Bytes" name="PS512_16" value="0x0"/>
        <value caption="Main area 1024 Bytes + Spare area 32 Bytes = 1056 Bytes" name="PS1024_32" value="0x1"/>
        <value caption="Main area 2048 Bytes + Spare area 64 Bytes = 2112 Bytes" name="PS2048_64" value="0x2"/>
        <value caption="Main area 4096 Bytes + Spare area 128 Bytes = 4224 Bytes" name="PS4096_128" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_ECC_MD__TYPCORREC">
        <value caption="1 bit correction for a page of 512/1024/2048/4096 Bytes  (for 8 or 16-bit NAND Flash)" name="CPAGE" value="0x0"/>
        <value caption="1 bit correction for 256 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)" name="C256B" value="0x1"/>
        <value caption="1 bit correction for 512 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)" name="C512B" value="0x2"/>
      </value-group>
